Repository: GitteM/Nexus
Catalog: Nexus/Localizable.xcstrings
Source language: en
Languages: et, ru

source: %@ card ending in %@, %@
et: %@, lõpeb numbritega %@, %@
ru: %@, заканчивается на %@, %@

source: A replacement offer will appear on your Dashboard. The lost card stays blocked.
et: Asenduskaardi pakkumine ilmub teie avalehele. Kadunud kaart jääb blokeerituks.
ru: Предложение о замене появится на главном экране. Утерянная карта останется заблокированной.

source: A system service is unavailable — contact support if it keeps happening.
et: Süsteemiteenus pole saadaval — kui see kordub, võtke ühendust toega.
ru: Системный сервис недоступен — если это повторится, обратитесь в поддержку.

source: A system service isn't available right now.
et: Süsteemiteenus pole praegu saadaval.
ru: Системный сервис сейчас недоступен.

source: Account activity
et: Konto liikumised
ru: Движения по счёту

source: Active
et: Aktiivne
ru: Активна

source: Add
et: Lisa
ru: Добавить

source: Add %@
et: Lisa %@
ru: Добавить %@

source: Add funds or use a different card.
et: Lisage raha või kasutage teist kaarti.
ru: Пополните счёт или используйте другую карту.

source: Added
et: Lisatud
ru: Добавлена

source: All categories
et: Kõik kategooriad
ru: Все категории

source: All statuses
et: Kõik staatused
ru: Все статусы

source: All time
et: Kogu aeg
ru: За всё время

source: Amount
et: Summa
ru: Сумма

source: Available
et: Saadaolev
ru: Доступно

source: Back
et: Tagasi
ru: Назад

source: Balance
et: Saldo
ru: Баланс

source: Bills
et: Arved
ru: Счета

source: Cancel
et: Tühista
ru: Отмена

source: Card %lld of %lld
et: Kaart %lld (kokku %lld)
ru: Карточка %lld из %lld

source: Card ••%@
et: Kaart ••%@
ru: Карта ••%@

source: Card controls
et: Kaardi haldus
ru: Управление картой

source: Cards you add and offers you can browse will appear here.
et: Teie lisatud kaardid ja sirvitavad pakkumised ilmuvad siia.
ru: Добавленные вами карты и доступные предложения появятся здесь.

source: Category
et: Kategooria
ru: Категория

source: Check your connection and try again.
et: Kontrollige ühendust ja proovige uuesti.
ru: Проверьте соединение и попробуйте снова.

source: Cleared
et: Sooritatud
ru: Проведена

source: Connected
et: Ühendatud
ru: Подключено

source: Connecting
et: Ühendamine
ru: Подключение

source: Connection Error
et: Ühenduse viga
ru: Ошибка соединения

source: Contact support if it keeps happening.
et: Kui see kordub, võtke ühendust toega.
ru: Если это повторится, обратитесь в поддержку.

source: Couldn't Add Card
et: Kaardi lisamine ebaõnnestus
ru: Не удалось добавить карту

source: Couldn't Update Card
et: Kaardi muutmine ebaõnnestus
ru: Не удалось обновить карту

source: Credit
et: Krediitkaart
ru: Кредитная карта

source: Credit limit
et: Krediidilimiit
ru: Кредитный лимит

source: Current limit
et: Kehtiv limiit
ru: Текущий лимит

source: Daily
et: Päevane
ru: Дневной

source: Dashboard
et: Avaleht
ru: Главная

source: Date
et: Kuupäev
ru: Дата

source: Debit
et: Deebetkaart
ru: Дебетовая карта

source: Details
et: Üksikasjad
ru: Подробности

source: Dining
et: Toitlustus
ru: Рестораны

source: Disconnected
et: Katkestatud
ru: Отключено

source: Done
et: Valmis
ru: Готово

source: Edit
et: Muuda
ru: Изменить

source: Entertainment
et: Meelelahutus
ru: Развлечения

source: Expired
et: Aegunud
ru: Истекла

source: Explore offers
et: Uuri pakkumisi
ru: Смотреть предложения

source: Filter transactions
et: Filtreeri tehinguid
ru: Фильтр операций

source: Filters active
et: Filtrid aktiivsed
ru: Фильтры активны

source: Find your new card offer on the Dashboard and add it.
et: Leidke oma uue kaardi pakkumine avalehelt ja lisage see.
ru: Найдите предложение новой карты на главном экране и добавьте его.

source: Freeze card
et: Külmuta kaart
ru: Заморозить карту

source: Freeze this card?
et: Kas külmutada see kaart?
ru: Заморозить эту карту?

source: Frozen
et: Külmutatud
ru: Заморожена

source: Groceries
et: Toidukaubad
ru: Продукты

source: Last 7 days
et: Viimased 7 päeva
ru: Последние 7 дней

source: Last 30 days
et: Viimased 30 päeva
ru: Последние 30 дней

source: Last 90 days
et: Viimased 90 päeva
ru: Последние 90 дней

source: Loading
et: Laadimine
ru: Загрузка

source: Loading transactions
et: Laen tehinguid
ru: Загружаем операции

source: Loading your card
et: Laen teie kaarti
ru: Загружаем вашу карту

source: Loading your cards
et: Laen teie kaarte
ru: Загружаем ваши карты

source: Location
et: Asukoht
ru: Местоположение

source: Lost
et: Kadunud
ru: Утеряна

source: Merchant
et: Kaupmees
ru: Продавец

source: Monthly
et: Kuine
ru: Месячный

source: New purchases and withdrawals will be blocked until you unfreeze.
et: Uued ostud ja väljamaksed on blokeeritud, kuni tühistate külmutuse.
ru: Новые покупки и снятия наличных будут заблокированы, пока вы не разморозите карту.

source: Nexus couldn't start. Please try again.
et: Nexuse käivitamine ebaõnnestus. Proovige uuesti.
ru: Не удалось запустить Nexus. Попробуйте ещё раз.

source: No cards yet
et: Kaarte veel pole
ru: Карт пока нет

source: No filters
et: Filtrid puuduvad
ru: Фильтров нет

source: No matching transactions
et: Sobivaid tehinguid ei leitud
ru: Нет подходящих операций

source: No transactions yet
et: Tehinguid veel pole
ru: Операций пока нет

source: Not set
et: Määramata
ru: Не задан

source: Nothing to do — the card is already added.
et: Midagi teha pole — kaart on juba lisatud.
ru: Ничего делать не нужно — карта уже добавлена.

source: Other
et: Muu
ru: Другое

source: Pending
et: Ootel
ru: В обработке

source: Prepaid
et: Ettemakstud kaart
ru: Предоплаченная карта

source: Reconnect
et: Ühenda uuesti
ru: Подключиться

source: Reconnect to keep your cards and balances up to date.
et: Ühendage uuesti, et teie kaardid ja saldod püsiksid ajakohasena.
ru: Подключитесь снова, чтобы карты и балансы оставались актуальными.

source: Refresh
et: Värskenda
ru: Обновить

source: Refresh your cards and try again.
et: Värskendage kaarte ja proovige uuesti.
ru: Обновите карты и попробуйте снова.

source: Refund
et: Tagasimakse
ru: Возврат

source: Replacement requested
et: Asenduskaart taotletud
ru: Замена запрошена

source: Report lost
et: Teata kaotamisest
ru: Сообщить об утере

source: Report lost or stolen
et: Teata kaotamisest või vargusest
ru: Сообщить об утере или краже

source: Report stolen
et: Teata vargusest
ru: Сообщить о краже

source: Report this card lost or stolen?
et: Kas teatada selle kaardi kaotamisest või vargusest?
ru: Сообщить об утере или краже этой карты?

source: Request a replacement card?
et: Kas taotleda asenduskaarti?
ru: Запросить замену карты?

source: Request replacement
et: Taotle asenduskaarti
ru: Запросить замену

source: Reset
et: Lähtesta
ru: Сбросить

source: Reset demo
et: Lähtesta demo
ru: Сбросить демо-режим

source: Restart the app to try again.
et: Rakenduse taaskäivitamine võimaldab uuesti proovida.
ru: Перезапустите приложение и попробуйте снова.

source: Retry
et: Proovi uuesti
ru: Повторить

source: Review the highlighted fields and try again.
et: Vaadake märgistatud väljad üle ja proovige uuesti.
ru: Проверьте выделенные поля и попробуйте снова.

source: Save
et: Salvesta
ru: Сохранить

source: Search by merchant
et: Otsi kaupmehe järgi
ru: Поиск по продавцу

source: Set %@ limit
et: Määra %@ limiit
ru: Установить %@ лимит

source: Shopping
et: Ostud
ru: Покупки

source: Showing %lld of %lld
et: Kuvatud %lld (kokku %lld)
ru: Показано %lld из %lld

source: Some of the information you entered isn't valid.
et: Osa sisestatud andmetest ei sobi.
ru: Часть введённых данных некорректна.

source: Something went wrong
et: Midagi läks valesti
ru: Что-то пошло не так

source: Something went wrong while preparing your data.
et: Andmete ettevalmistamisel läks midagi valesti.
ru: При подготовке ваших данных что-то пошло не так.

source: Something went wrong.
et: Midagi läks valesti.
ru: Что-то пошло не так.

source: Spending limits
et: Kululimiidid
ru: Лимиты расходов

source: Status
et: Staatus
ru: Статус

source: Status: %@
et: Staatus: %@
ru: Статус: %@

source: The '%@' action failed.
et: Toiming „%@“ ebaõnnestus.
ru: Не удалось выполнить действие «%@».

source: The app couldn't finish starting up.
et: Rakenduse käivitamine jäi lõpetamata.
ru: Не удалось завершить запуск приложения.

source: The card is blocked. Request a replacement card.
et: Kaart on blokeeritud. Taotlege asenduskaarti.
ru: Карта заблокирована. Запросите замену карты.

source: The card will be blocked right away. You can request a replacement next.
et: Kaart blokeeritakse kohe. Seejärel saate taotleda asenduskaarti.
ru: Карта будет немедленно заблокирована. После этого вы сможете запросить замену.

source: The card will work again immediately.
et: Kaart hakkab kohe uuesti tööle.
ru: Карта снова сразу заработает.

source: The data we received couldn't be read — contact support if it keeps happening.
et: Saadud andmeid ei õnnestunud lugeda — kui see kordub, võtke ühendust toega.
ru: Не удалось прочитать полученные данные — если это повторится, обратитесь в поддержку.

source: The request took too long.
et: Päring võttis liiga kaua aega.
ru: Запрос занял слишком много времени.

source: There aren't enough funds for this payment.
et: Selle makse jaoks ei jätku raha.
ru: Недостаточно средств для этого платежа.

source: This card couldn't be found.
et: Seda kaarti ei leitud.
ru: Не удалось найти эту карту.

source: This card is already in your wallet.
et: See kaart on juba teie rahakotis.
ru: Эта карта уже в вашем кошельке.

source: This card is lost
et: See kaart on kadunud
ru: Эта карта утеряна

source: This is a technical issue — contact support if it keeps happening.
et: Tegu on tehnilise probleemiga — kui see kordub, võtke ühendust toega.
ru: Это техническая проблема — если она повторится, обратитесь в поддержку.

source: Transaction ID
et: Tehingu ID
ru: ID операции

source: Transactions
et: Tehingud
ru: Операции

source: Transactions for this card will appear here.
et: Selle kaardi tehingud kuvatakse siin.
ru: Операции по этой карте появятся здесь.

source: Transfer
et: Ülekanne
ru: Переводы

source: Travel
et: Reisimine
ru: Путешествия

source: Try again in a moment.
et: Proovige veidi aja pärast uuesti.
ru: Повторите через некоторое время.

source: Try clearing a filter or searching for something else.
et: Proovige mõni filter eemaldada või otsida midagi muud.
ru: Попробуйте сбросить фильтр или поискать что-то другое.

source: Try saving again.
et: Proovige uuesti salvestada.
ru: Попробуйте сохранить ещё раз.

source: Try the action again.
et: Proovige toimingut uuesti.
ru: Повторите действие.

source: Unfreeze card
et: Tühista kaardi külmutamine
ru: Разморозить карту

source: Unfreeze this card?
et: Kas tühistada selle kaardi külmutamine?
ru: Разморозить эту карту?

source: We couldn't reach the server.
et: Me ei jõudnud serverini.
ru: Не удалось связаться с сервером.

source: We couldn't read the data we received.
et: Saadud andmeid ei õnnestunud lugeda.
ru: Не удалось прочитать полученные данные.

source: Weekly
et: Nädalane
ru: Недельный

source: You're offline
et: Olete võrguühenduseta
ru: Вы не в сети

source: Your cards
et: Teie kaardid
ru: Ваши карты

source: Your data couldn't be saved.
et: Teie andmeid ei õnnestunud salvestada.
ru: Не удалось сохранить ваши данные.

source: Filter
ru: Фильтр

source: OK
ru: ОК
